In [4]:
import pandas as pd

pandas를 pd라고 부른다. 는 뜻

In [8]:
df = pd.read_csv('class.csv')

In [9]:
df

      name  age  class
0     Chan   17      1
1  Gildong   20      3
2      Kim   17      2
3      Yee   18      3
4       No   17      2
5     Kang   17      1

In [10]:
df.head() # 앞에 있는거 5개

      name  age  class
0     Chan   17      1
1  Gildong   20      3
2      Kim   17      2
3      Yee   18      3
4       No   17      2

In [11]:
df.head(2) # 앞에 있는거 2개

      name  age  class
0     Chan   17      1
1  Gildong   20      3

In [12]:
df.tail() # 뒤에 있는거 5개

      name  age  class
1  Gildong   20      3
2      Kim   17      2
3      Yee   18      3
4       No   17      2
5     Kang   17      1

In [13]:
df.tail(2) # 뒤에 있는거 2개

   name  age  class
4    No   17      2
5  Kang   17      1

In [18]:
df = pd.read_csv('test.txt')
df

Empty DataFrame
Columns: [Hi,  this is test ver.]
Index: []

txt 파일도 가능

In [19]:
df = pd.read_csv('test.txt', header=None)

In [20]:
df

    0                   1
0  Hi   this is test ver.

처음 값이 header로 인식 되었었는데 그걸 없앰

col name 값을 바꿀수 있음

In [21]:
df.columns = ['a', 'b']

In [22]:
df

    a                   b
0  Hi   this is test ver.

a와 b가 컬럼에 들어감

또 이렇게도 가능

In [23]:
df = pd.read_csv('test.txt', header=None, names = ['c','d'])

In [24]:
df

    c                   d
0  Hi   this is test ver.